Revit 2027 API
ParameterUtils.GetParameterTypeId Method
 Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GetParameterTypeId(
	BuiltInParameter builtInParam
)
Public Shared Function GetParameterTypeId (
	builtInParam As BuiltInParameter
) As ForgeTypeId
public:
static ForgeTypeId^ GetParameterTypeId(
	BuiltInParameter builtInParam
)
static member GetParameterTypeId :
        builtInParam : BuiltInParameter -> ForgeTypeId
Parameters
builtInParam BuiltInParameter
The BuiltInParameter value.
Return Value
ForgeTypeId
Identifier of the parameter corresponding to the given BuiltInParameter value.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace